---
show: step
version: 1.0
enable_checker: true
---

# HBase 基本操作

## 实验介绍

- HBase shell
- DDL 与 DML 操作

#### 知识点

- HBase shell 的常用命令
- HBase 的启动
- hadoop 表的操作

## Hbase Shell

本章介绍 HBase Shell 的一些常用命令。

首先，先打开终端切换到 hadoop 用户下：

```bash
su -l hadoop #密码为hadoop
```

![3-1](https://doc.shiyanlou.com/document-uid702660labid6145timestamp1524117265963.png/wm)

### 连接 HBase

首先，我们需要进入 hadoop-2.7.3 目录下的 `sbin` 文件夹中。

```bash
 cd /opt/hadoop-2.7.3/sbin/
```

![2-4.2-1](https://doc.shiyanlou.com/document-uid702660labid6604timestamp1527751480885.png/wm)

初始化 namenode：

```bash
hadoop namenode -format
```

![2-4.2-2](https://doc.shiyanlou.com/document-uid702660labid6604timestamp1527751856677.png/wm)

启动 hdfs：

```bash
./start-all.sh
```

![2-4.2-3](https://doc.shiyanlou.com/document-uid702660labid6604timestamp1527751880858.png/wm)

使用 `hbase shell` 命令来连接正在运行的 Hbase 实例，该命令位于 HBase 安装包下的 `bin/` 目录。HBase Shell 提示符以 `>` 符号结束。

```bash
cd /opt/hbase-1.2.6/bin/
./start-hbase.sh
./hbase shell
```

![3-1.1-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527755583975.png/wm)

### 显示 HBase Shell 帮助文档

输入 `help` 并按 Enter 键，可以显示 HBase Shell 的基本使用信息，和我们接下来会列举的一些命令类似。需要注意的是，表名，行，列都必须包含在引号内。

![3-1.2-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527755957389.png/wm)

### 退出 HBase Shell

使用 `quit` 命令，退出 HBase Shell 并且断开和集群的连接，但此时 HBase 仍然在后台运行（不用退出，后面我们还会继续使用 HBase shell）。

### 查看 HBase 状态

```
hbase(main):024:0>status
```

![3-1.4-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527755802609.png/wm)

### 关闭 HBase

和 `bin/start-hbase.sh` 开启所有的 HBase 进程相同，`bin/stop-hbase.sh` 用于关闭所有的 HBase 进程。

```bash
$ ./bin/stop-hbase.sh
stopping hbase....................
$
```

## 数据定义（DDL）操作

下面我们将给大家介绍数据定义（DDL）操作：

1. 创建新表
2. 列举表信息
3. 列举表描述
4. 删除表
5. 检查表是否存在

### 创建新表

使用 `create` 命令来创建一个新的表。在创建的时候，必须指定表名和列族名。

```
hbase(main):001:0> create 'test', 'cf'
0 row(s) in 9.4600 seconds

=> Hbase::Table - test
```

![3-2.1-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527756057897.png/wm)

### 列举表信息

使用 `list` 命令：

```
hbase(main):002:0> list 'test'
TABLE
test
1 row(s) in 0.1600 seconds

=> ["test"]
```

![3-2.2-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527756142428.png/wm)

### 获取表描述

使用 `describe` 命令：

```
hbase(main):003:0> describe 'test'
DESCRIPTION ENABLED
 'test', {NAME => 'f', DATA_BLOCK_ENCODING => 'NONE', BLOOMFILTER => 'ROW', REPLICATION_ true
 SCOPE => '0', VERSIONS => '1', COMPRESSION => 'NONE', MIN_VERSIONS => '0', TTL => '2
 147483647', KEEP_DELETED_CELLS => 'false', BLOCKSIZE => '65536', IN_MEMORY => 'false
 ', BLOCKCACHE => 'true'}
1 row(s) in 2.5030 seconds
```

![3-2.3-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527756362132.png/wm)

### 删除表

删除表之前，先 `disable` 表，再使用 `drop` 命令实现删除表的功能：

```
disable 'test'
drop 'test'
```

![3-2.4-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527756706940.png/wm)

### 检查表是否存在

```
exists 'test'
```

![3-2.5-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527757251269.png/wm)

## 数据管理（DML）操作

第四节我们给大家介绍数据管理（DML）操作：

1. 向表中插入数据
2. 一次性扫描全表数据
3. 获取一个行数据
4. 禁用一个表

### 向表中插入数据

重新创建 test 表，并使用 `put` 命令，将数据插入表中：

```
hbase(main):011:0> put 'test', 'row1', 'cf:a', 'value1'
0 row(s) in 0.4080 seconds

hbase(main):012:0> put 'test', 'row2', 'cf:b', 'value2'
0 row(s) in 0.1040 seconds

hbase(main):013:0> put 'test', 'row3', 'cf:c', 'value3'
0 row(s) in 0.0480 seconds
```

![3-4.1-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527757489063.png/wm)

可以看到，在本例中，一共插入了三条数据，一次一条。第一次插入到 `row1` 行，`cf:` 列，插入值为 `value1`。所有列在 HBase 中有一个列族前缀。本例中的 `cf`，后面跟着一个冒号还有一个列限定后缀，本例中是 `a`。

### 一次性扫描全表数据

一种获取 HBase 数据的方法是扫描，使用 `scan` 命令来扫描表的数据。可以限制限制扫描的范围，在本例中，获取的是所有的数据。

```
hbase(main):014:0> scan 'test'
ROW                                      COLUMN+CELL
 row1                                    column=cf:a, timestamp=1488782666959, value=value1
 row2                                    column=cf:b, timestamp=1488782679779, value=value2
 row3                                    column=cf:c, timestamp=1488782700678, value=value3
3 row(s) in 0.2490 seconds
```

![3-4.2-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527757595299.png/wm)

### 获取一个行数据

使用 `get` 命令来获得某一行的数据：

```
hbase(main):015:0> get 'test', 'row1'
COLUMN                                   CELL
 cf:a                                    timestamp=1488782666959, value=value1
1 row(s) in 0.0950 seconds
```

![3-4.3-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527757674138.png/wm)

### 禁用一个表

如果你想要删除一个表或是修改它的设置，或者是其它的情况，都需要首先禁用该表。使用 `disable` 命令禁用表，`enable` 命令重新启用表。

```
hbase(main):016:0> disable 'test'
0 row(s) in 3.8370 seconds

hbase(main):018:0> enable 'test'
0 row(s) in 1.0650 seconds
```

![3-4.4-1](https://doc.shiyanlou.com/document-uid702660labid6605timestamp1527757764057.png/wm)

## 实验总结

本章介绍了 HBase Shell 的一些基本的常用命令，主要包括数据定义（DLL）的数据管理（DML）的一些操作命令。只能满足基本的 HBase 操作，更进一步的了解，请通过阅读 HBase 官方教程。

#### 参考资料

- http://hbase.apache.org/book.html
